In [1]:
import numpy as np
import pandas as pd
import pickle
import string
import scipy

In [23]:
pay13 = pd.read_csv('/Volumes/Seagate/Galvanize/2013 Open Payments/OP_DTL_GNRL_PGYR2013_P01172018.csv', \
                    dtype={'Recipient_Zip_Code':object,'NDC_of_Associated_Covered_Drug_or_Biological1':object})

/Users/kunal/anaconda3/lib/python3.6/site-packages/IPython/core/interactiveshell.py:2728: DtypeWarning: Columns (4,7,9,11,16,17,21,22,23,24,35,36,37,40,41,42,43,48,49,50,51,52,54,55,56,57,58,59,60,61,62) have mixed types. Specify dtype option on import or set low_memory=False.
  interactivity=interactivity, compiler=compiler, result=result)

In [24]:
pay13nj= pay13[pay13['Recipient_State']=='NJ']

In [10]:
pay13nj.to_csv('/Volumes/Seagate/Galvanize/nj_payments_2013.csv',index=False)

NameError: name 'pay13nj' is not defined

### <font color='forestgreen'>Grabbing Only Columns we need</font>

**nj_payments_2013.csv = ALL COLUMNS**

**nj_payments_2013_consl.csv = ONLY Columns for SCRIPTS**

### Just looking at duplicates & stuff now

In [128]:
df = payments_nj_13.groupby(['company_id','company']).sum()['amount'].to_frame()
df.reset_index(inplace=True)
df.sort_values(by='amount',ascending=False).head()
df[df['company_id'].isin(df['company_id'][df['company_id'].duplicated()])].sort_values("company_id")
#WOO NO DUPLICATES ANYMORE

Empty DataFrame
Columns: [company_id, company, amount]
Index: []

In [132]:
df = payments_nj_full.groupby(['npi','fn','ln']).sum()['amount'].to_frame()
df.reset_index(inplace=True)
df[df['npi'].isin(df['npi'][df['npi'].duplicated()])].sort_values("npi")
#I don't mind the duplicated names because when I search I'll use the NPI data & then print out alternative names to the user as well

              npi               fn            ln    amount
116    1013014521                S       VELASCO     38.09
117    1013014521            SONIA       VELASCO     17.25
219    1023006095             MARY     WITKOWSKI    142.79
220    1023006095         MARYBETH     WITKOWSKI     27.16
317    1023315918            LADAN       ILKHANI    268.18
318    1023315918            LADAN  ILKHANIZADEH     14.61
339    1033123914           CARLOS       QUEZADA    129.75
340    1033123914           CARLOS  QUEZADAREYES     94.14
542    1043453616            SARAH       MANSSON    107.20
543    1043453616        SARAHJANE       MANSSON    146.96
577    1053330647         JONATHAN          YRAD     75.92
578    1053330647  JONATHANPROCESO          YRAD     45.00
638    1053411272             JUNG          SHEN     52.07
639    1053411272          JUNGSAN          SHEN     99.94
655    1053457986           ASHISH        KAPOOR    162.99
656    1053457986            VINOD        KAPOOR   1665.91
758    1063492965        DAYAPARAN     NADARAJAH    796.30
757    1063492965             DAYA     NADARAJAH   1800.53
920    1073682399           PHILIP        WERNER     72.95
921    1073682399          PHILLIP        WERNER    103.44
968    1083644322          MATTHEW   CHOLANKERIL    786.68
969    1083644322      THRESSIAMMA   CHOLANKERIL    651.97
980    1083659064           DEBORA        GELLER    204.71
981    1083659064          DEBORAH        GELLER     22.82
1004   1083685747          SUSANNE    ZIMMERMANN     77.29
1003   1083685747          SUSANNE     ZIMMERMAN    987.22
1137   1093796211         KATHLEEN         CASEY  28092.63
1138   1093796211         KATHLEEN       DOWLING     21.76
1254   1104872167          MICHAEL        PISKUN    220.06
1255   1104872167          MICHAEL        SCHUTZ    117.62
...           ...              ...           ...       ...
11776  1952415705         JULIANNE        KUFLIK    914.26
11783  1952458903           THOMAS     SUCZEWSKI     85.97
11782  1952458903           EDWARD     SUCZEWSKI    141.97
11820  1962400119           RUSSEL          GURA    376.54
11821  1962400119          RUSSELL          GURA     77.16
11856  1962454967            ABHAY          SUDA    592.98
11857  1962454967           ANJULI          SUDA    285.33
11911  1962598813             JOHN       BERNARD     26.92
11912  1962598813             JOHN       COCCARO     10.28
11913  1962598813             JOHN      KRAYNOCK     15.69
11921  1962649327          MICHAEL        YASNER     34.17
11920  1962649327          MICHAEL      SULLIVAN     64.87
12064  1982610879             ALAN       HELFMAN   4225.26
12065  1982610879             ALAN     STRUMEYER    821.51
12106  1982670675           CECILY         LESKO    405.90
12107  1982670675          WILLIAM         LESKO    119.05
12128  1982690574            SHAWN         KLEIN     85.62
12129  1982690574           WARREN         KLEIN    123.16
12138  1982693990          MICHAEL       FUHRMAN   1856.15
12139  1982693990          MICHAEL        KERNER    646.05
12166  1982785085            MAHER         BADRI    148.89
12167  1982785085           MMAHER         BADRI    922.12
12218  1992716021            NANCY    FREUNDLICH     94.87
12219  1992716021          RICHARD    FREUNDLICH    133.18
12247  1992758932           SANDRA         UGRAS     21.44
12248  1992758932           SANDRA      UGRASREY    331.28
12291  1992807382             DINO      ESPINELI    461.45
12292  1992807382        ROSALINDA      ESPINELI    187.88
12307  1992858112             IGOR         SOBOL   1116.00
12308  1992858112           MARINA         SOBOL   1165.73

[572 rows x 4 columns]

# **<font color='red'>Payments</font>**

In [1]:
import pandas as pd
import numpy as np
import pickle
import re

In [2]:
#Reading the csv that we saved, The NDCs have to be read as objects becuase otherwise the leading 0s get cut
payments_nj_full = pd.read_csv('/Volumes/Seagate/Galvanize/nj_payments_all_years_consl.csv',
                            dtype={'zip':object,'name_d1':object,'name_d5':object,'ndc_d1':object,'ndc_d2':object, \
                                   'ndc_d3':object, 'ndc_d4':object,'ndc_d5':object, 'npi':object,'company_id':object, \
                                  'payment_id':object,'record_id':object})

## **<font color='royalblue'>Just doing some Groupbys here</font>**

In [61]:
df = payments_nj_full.groupby(['npi','fn','ln','specialty','company','year']).agg({'record_id':'count','amount':'sum'})
df.reset_index(inplace=True)
df.sort_values(by='amount',ascending=False).head()

,npi,fn,ln,specialty,company,year,record_id,amount
115335,1477533925,LOWELL,KABNICK,Other Service Providers|Specialist,ANGIODYNAMICS,2014,3,560579.24
93570,1386639722,MARK,HARTZBAND,Allopathic & Osteopathic Physicians|Orthopaedi...,ZIMMER BIOMET HOLDINGS,2015,27,501090.10
93572,1386639722,MARK,HARTZBAND,Allopathic & Osteopathic Physicians|Orthopaedi...,ZIMMER HOLDING,2014,66,454611.34
115336,1477533925,LOWELL,KABNICK,Other Service Providers|Specialist,ANGIODYNAMICS,2015,3,402616.56
233256,1932130317,JASON,LOWENSTEIN,Allopathic & Osteopathic Physicians|Orthopaedi...,NUVASIVE,2014,6,393817.87

In [62]:
df = payments_nj_full.groupby(['npi','fn','ln','specialty','record_id','year']).agg({'amount':'sum'})
df.reset_index(inplace=True)
df.sort_values(by='amount',ascending=False).head()

,npi,fn,ln,specialty,record_id,year,amount
431241,1477666923,SUNEET,MITTAL,Allopathic & Osteopathic Physicians|Internal M...,222073094,2014,323987.71
426248,1477533925,LOWELL,KABNICK,Other Service Providers|Specialist,144995294,2014,307132.23
426247,1477533925,LOWELL,KABNICK,Other Service Providers|Specialist,144995288,2014,251973.51
426266,1477533925,LOWELL,KABNICK,Other Service Providers|Specialist,254053310,2015,232061.39
735629,1801856562,JOHN,ZIMMERMAN,Allopathic & Osteopathic Physicians|Internal M...,222096352,2014,198746.60

In [63]:
payments_nj_full.groupby(['company','year']).sum()['amount'].to_frame().sort_values(by='amount',ascending=False).head(10)

                                      amount
company                     year
ASTRAZENECA PHARMACEUTICALS 2014  2092803.00
JANSSEN PHARMACEUTICALS     2015  1901962.45
ABBVIE                      2015  1575694.16
ZIMMER BIOMET HOLDINGS      2015  1499579.10
ASTRAZENECA PHARMACEUTICALS 2015  1446606.81
JANSSEN PHARMACEUTICALS     2014  1308985.26
ABBVIE                      2014  1282778.42
ER SQUIBB SONS              2015   956901.59
TEVA PHARMACEUTICALS USA    2014   953858.99
                            2015   893263.29

In [14]:
print("2013 Total Payments in NJ: {}, \n Total Amount paid: {}".format(payments_nj_full.groupby(['year']).count()['amount'].to_frame()['amount'][2013],payments_nj_full.groupby(['year']).sum()['amount'].to_frame()['amount'][2013]))
print("2014 Total Payments in NJ: {}, \n Total Amount paid: {}".format(payments_nj_full.groupby(['year']).count()['amount'].to_frame()['amount'][2014],payments_nj_full.groupby(['year']).sum()['amount'].to_frame()['amount'][2014]))
print("2015 Total Payments in NJ: {}, \n Total Amount paid: {}".format(payments_nj_full.groupby(['year']).count()['amount'].to_frame()['amount'][2015],payments_nj_full.groupby(['year']).sum()['amount'].to_frame()['amount'][2015]))

2013 Total Payments in NJ: 136916,
 Total Amount paid: 13592322.070001055
2014 Total Payments in NJ: 390602,
 Total Amount paid: 36071036.550007306
2015 Total Payments in NJ: 399498,
 Total Amount paid: 38499500.149998784

In [15]:
print("2013 Avg amount paid: {}".format(payments_nj_full.groupby(['year']).agg({'amount':'mean'})['amount'][2013]))
print("2014 Avg amount paid: {}".format(payments_nj_full.groupby(['year']).agg({'amount':'mean'})['amount'][2014]))
print("2015 Avg amount paid: {}".format(payments_nj_full.groupby(['year']).agg({'amount':'mean'})['amount'][2015]))

2013 Avg amount paid: 99.27489898916895
2014 Avg amount paid: 92.3472909765114
2015 Avg amount paid: 96.36969434139542

In [64]:
payments_nj_full.isnull().sum()

payment_id         0
fn                 0
ln                 0
address            0
city               0
state              0
zip                0
specialty       1297
company_id         0
company            0
amount             0
form               0
nature             0
phys_owns          0
record_id          0
name_d1            0
name_d2          150
name_d3            0
name_d4            0
name_d5            0
ndc_d1        267703
ndc_d2        753287
ndc_d3        873882
ndc_d4        919049
ndc_d5        924024
year               0
npi                0
dtype: int64

In [189]:
payments_nj_full.replace(to_replace='NAN',value=np.nan,inplace=True)

## **<font color='royalblue'>Looking at the typical amount paid</font>**

In [74]:
pd.concat([pd.DataFrame(np.array(['2013','|','|','2013','2013','|','|','2013']), \
             index=list(payments_nj_full[payments_nj_full['year']==2013].describe().index)), \
           payments_nj_full[payments_nj_full['year']==2013].describe(). \
           drop(['year'],axis=1), \
           pd.DataFrame(np.array(['2014','|','|','2014','2014','|','|','2014']), \
             index=list(payments_nj_full[payments_nj_full['year']==2014].describe().index)), \
           payments_nj_full[payments_nj_full['year']==2014].describe(). \
           drop(['year'],axis=1), \
           pd.DataFrame(np.array(['2015','|','|','2015','2015','|','|','2015']), \
             index=list(payments_nj_full[payments_nj_full['year']==2015].describe().index)), \
           payments_nj_full[payments_nj_full['year']==2015].describe(). \
           drop(['year'],axis=1)],axis=1)

          0         amount     0         amount     0         amount
count  2013  136916.000000  2014  390602.000000  2015  399498.000000
mean      |      99.274899     |      92.347291     |      96.369694
std       |     662.003935     |    1105.938114     |     944.139931
min    2013       0.000000  2014       0.000000  2015       0.010000
25%    2013      11.840000  2014      11.090000  2015      11.610000
50%       |      16.050000     |      15.260000     |      15.710000
75%       |      23.990000     |      21.810000     |      21.940000
max    2013  123255.000000  2014  323987.710000  2015  232061.390000

In [3]:
d = payments_nj_full.describe(include='all').drop(['state','year'],axis=1).to_dict('dict')
nd = {}
for col in d:
    nd[col]={}
    for val in d[col]:
        try:
            x = np.isnan(d[col][val])
            if x:
                continue
            elif not x:
                nd[col][val] = d[col][val]
        except:
            nd[col][val] = d[col][val]
nd

{'address': {'count': 927016,
  'freq': 5782,
  'top': '100 MADISON AVE',
  'unique': 24187},
 'amount': {'25%': 11.43,
  '50%': 15.57,
  '75%': 22.15,
  'count': 927016.0,
  'max': 323987.71,
  'mean': 95.10392352450893,
  'min': 0.0,
  'std': 981.9568902637541},
 'city': {'count': 927016, 'freq': 22669, 'top': 'TOMSRIVER', 'unique': 1274},
 'company': {'count': 927016,
  'freq': 63142,
  'top': 'ASTRAZENECA PHARMACEUTICALS',
  'unique': 874},
 'company_id': {'count': 927016,
  'freq': 63142,
  'top': '100000000146',
  'unique': 867},
 'fn': {'count': 927016, 'freq': 30188, 'top': 'MICHAEL', 'unique': 4504},
 'form': {'count': 927016,
  'freq': 779838,
  'top': 'In-kind items and services',
  'unique': 3},
 'ln': {'count': 927016, 'freq': 14100, 'top': 'PATEL', 'unique': 10882},
 'name_d1': {'count': 771821, 'freq': 25231, 'top': 'XARELTO', 'unique': 1336},
 'name_d2': {'count': 199702, 'freq': 12414, 'top': 'VICTOZA', 'unique': 621},
 'name_d3': {'count': 59622, 'freq': 5701, 'top': 'JANUMETXR', 'unique': 408},
 'name_d4': {'count': 9082, 'freq': 1252, 'top': 'ANDROGEL', 'unique': 184},
 'name_d5': {'count': 3035, 'freq': 1252, 'top': 'LUPRON', 'unique': 70},
 'nature': {'count': 927016,
  'freq': 824519,
  'top': 'Food and Beverage',
  'unique': 14},
 'ndc_d1': {'count': 659313,
  'freq': 23129,
  'top': '0169-6439-90',
  'unique': 1449},
 'ndc_d2': {'count': 173729,
  'freq': 12414,
  'top': '0169-4060-90',
  'unique': 816},
 'ndc_d3': {'count': 53134,
  'freq': 3567,
  'top': '0169-4060-90',
  'unique': 495},
 'ndc_d4': {'count': 7967, 'freq': 1252, 'top': '0051-8462-33', 'unique': 202},
 'ndc_d5': {'count': 2992, 'freq': 1252, 'top': '0074-3346-03', 'unique': 74},
 'npi': {'count': 927016, 'freq': 2214, 'top': '1316032394', 'unique': 16482},
 'payment_id': {'count': 927016,
  'freq': 2214,
  'top': '241250.0',
  'unique': 16888},
 'phys_owns': {'count': 927016, 'freq': 926122, 'top': 'No', 'unique': 2},
 'record_id': {'count': 927016,
  'freq': 1,
  'top': '317510354',
  'unique': 927016},
 'specialty': {'count': 925719,
  'freq': 196052,
  'top': 'Allopathic & Osteopathic Physicians|Internal Medicine',
  'unique': 270},
 'zip': {'count': 927016, 'freq': 13103, 'top': '07960', 'unique': 7540}}

# **<font color='red'>Scripts</font>**

In [3]:
scriptsnj13 = pd.read_csv('/Volumes/Seagate/Galvanize/2013_scriptsnj.csv', dtype={'npi':object})
scriptsnj14 = pd.read_csv('/Volumes/Seagate/Galvanize/2014_scriptsnj.csv', dtype={'npi':object})
scriptsnj15 = pd.read_csv('/Volumes/Seagate/Galvanize/2015_scriptsnj.csv', dtype={'npi':object})

In [31]:
scriptsnjfull = pd.read_csv('/Volumes/Seagate/Galvanize/nj_scripts_all_years.csv', dtype={'npi':object})

In [29]:
scriptsnjfull.head(2)

,npi,nppes_provider_last_org_name,nppes_provider_first_name,nppes_provider_city,nppes_provider_state,specialty_description,year,drug_name,generic_name,total_claim_count,total_day_supply,total_drug_cost,brand_drug?
0,1528036670,LANTERI,VINCENT,MAYWOOD,NJ,Urology,2013,VIAGRA,SILDENAFIL,48,1481,8957.33,True
1,1528036670,LANTERI,VINCENT,MAYWOOD,NJ,Urology,2013,CLOTRIMAZOLE BETAMETHASONE,CLOTRIMAZOLE BETAMETHASONE,16,367,806.59,False

In [32]:
scriptsnjfull.groupby(['year','brand_drug?']).agg({'total_claim_count':'sum','total_drug_cost':'sum'})

                  total_claim_count  total_drug_cost
year brand_drug?
2013 False                 22082933     6.346964e+08
     True                   6208380     1.955857e+09
2014 False                 23288383     6.772004e+08
     True                   5684384     2.276462e+09
2015 False                 24716615     6.878899e+08
     True                   5196218     2.533153e+09

In [33]:
x = scriptsnjfull.groupby(['year','brand_drug?']).agg({'total_claim_count':'sum','total_drug_cost':'sum'})
x['avg_drug_cost'] = (x['total_drug_cost']/x['total_claim_count'])
x

                  total_claim_count  total_drug_cost  avg_drug_cost
year brand_drug?
2013 False                 22082933     6.346964e+08      28.741488
     True                   6208380     1.955857e+09     315.035007
2014 False                 23288383     6.772004e+08      29.078891
     True                   5684384     2.276462e+09     400.476500
2015 False                 24716615     6.878899e+08      27.831074
     True                   5196218     2.533153e+09     487.499366

In [36]:
s = scriptsnjfull.groupby(['specialty_description','brand_drug?']).agg({'total_claim_count':'sum'}).reset_index()
s.head()

  specialty_description  brand_drug?  total_claim_count
0         Acupuncturist        False                 35
1    Addiction Medicine        False               3294
2    Addiction Medicine         True                224
3    Allergy/Immunology        False             111802
4    Allergy/Immunology         True              72457

In [37]:
#Checking which specialities write MORE brand name prescriptions than generics
d = {}
for i in s['specialty_description'].unique():
    d[i] = {}
    for tf in s['brand_drug?'].unique():
        n = list((s[(s['specialty_description']==i) & (s['brand_drug?']==tf)])['total_claim_count'])
        for j in n:
            d[i][tf] = j
for i in d:
     v=list(d[i].values())
     k=list(d[i].keys())
     d[i] = k[v.index(max(v))]
[k for k,v in d.items() if v == True]

['Optometry', 'Personal Emergency Response Attendant', 'Radiation Oncology']

In [38]:
s[s['specialty_description'].isin(['Optometry', 'Personal Emergency Response Attendant', 'Radiation Oncology'])]

                     specialty_description  brand_drug?  total_claim_count
128                              Optometry        False             138243
129                              Optometry         True             170255
148  Personal Emergency Response Attendant        False                 28
149  Personal Emergency Response Attendant         True                 36
178                     Radiation Oncology        False              13864
179                     Radiation Oncology         True              38130

# **<font color='red'>Payments + Scripts</font>**

In [1]:
import numpy as np
import pandas as pd
import pickle

In [194]:
scriptsnjfull = pd.read_csv('/Volumes/Seagate/Galvanize/nj_scripts_all_years.csv',dtype={'npi':object})

In [195]:
#Reading the csv that we saved, The NDCs have to be read as objects becuase otherwise the leading 0s get cut
paymentsnjfull = pd.read_csv('/Volumes/Seagate/Galvanize/nj_payments_all_years_consl.csv',
                            dtype={'zip':object,'name_d1':object,'name_d5':object,'ndc_d1':object,'ndc_d2':object, \
                                   'ndc_d3':object, 'ndc_d4':object,'ndc_d5':object, 'npi':object,'company_id':object, \
                                  'payment_id':object,'record_id':object})

In [174]:
paymentsnjfull.head(1)

,payment_id,npi,fn,ln,address,city,state,zip,specialty,company_id,...,name_d2,name_d3,name_d4,name_d5,ndc_d1,ndc_d2,ndc_d3,ndc_d4,ndc_d5,year
0,235088.0,1174629083,FATIMA,ASGHAR,94 OLD SHORT HILLS RD,LIVINGSTON,NJ,07039,Allopathic & Osteopathic Physicians|Internal M...,100000005529,...,NaN,NaN,NaN,NaN,0456120130,NaN,NaN,NaN,NaN,2013

# <font color=#00FFCD>**HYPOTHESIS TESTING**</font>

In [17]:
p13 = pd.read_csv('/Volumes/Seagate/Galvanize/nj_payments_2013_consl.csv',
                            dtype={'zip':object,'name_d1':object,'name_d5':object,'ndc_d1':object,'ndc_d2':object, \
                                   'ndc_d3':object, 'ndc_d4':object,'ndc_d5':object, 'npi':object,'company_id':object, \
                                  'payment_id':object,'record_id':object})

In [18]:
scriptsnjfull = pd.read_csv('/Volumes/Seagate/Galvanize/nj_scripts_all_years.csv',dtype={'npi':object})

In [19]:
scriptsnjfull.head(2)

,npi,nppes_provider_last_org_name,nppes_provider_first_name,nppes_provider_city,nppes_provider_state,specialty_description,year,recieved_payments,total_claim_count,amount_brand,drug_name,generic_name,brand_drug?,total_day_supply,total_drug_cost
0,1528036670,LANTERI,VINCENT,MAYWOOD,NJ,Urology,2013,True,48,48,VIAGRA,SILDENAFIL,True,1481,8957.33
1,1528036670,LANTERI,VINCENT,MAYWOOD,NJ,Urology,2013,True,16,0,CLOTRIMAZOLE BETAMETHASONE,CLOTRIMAZOLE BETAMETHASONE,False,367,806.59

In [20]:
p13.head(2)

,payment_id,fn,ln,address,city,state,zip,specialty,company_id,company,...,name_d3,name_d4,name_d5,ndc_d1,ndc_d2,ndc_d3,ndc_d4,ndc_d5,year,npi
0,235088.0,FATIMA,ASGHAR,94 OLD SHORT HILLS RD,LIVINGSTON,NJ,07039,Allopathic & Osteopathic Physicians|Internal M...,100000005529,FOREST PHARMACEUTICALS,...,NAN,NAN,NAN,0456120130,NaN,NaN,NaN,NaN,2013,1174629083
1,334868.0,RAGHUVEER,ANNAM,290 RED SCHOOL LN,PHILLIPSBURG,NJ,08865,Allopathic & Osteopathic Physicians|Internal M...,100000005529,FOREST PHARMACEUTICALS,...,NAN,NAN,NAN,0456120130,NaN,NaN,NaN,NaN,2013,1386735850

In [6]:
s13 = pd.read_csv('/Volumes/Seagate/Galvanize/2013_scriptsnj.csv', dtype={'npi':object})

In [5]:
print("{} unique NPIs who got paid \n{} unique NPIs who wrote prescriptions \n{} unique NPIs who wrote prescriptions & got a payment". \
      format(len(p13.npi.unique()), len(s13.npi.unique()),len(list(set(p13.npi).intersection(set(s13.npi))))))

12034 unique NPIs who got paid
22485 unique NPIs who wrote prescriptions
11267 unique NPIs who wrote prescriptions & got a payment

In [227]:
#Groupby to see the amount of doctors from that speciality who did & did not recieve payments
grp = s13.groupby(['specialty_description','recieved_payments'])['npi'].nunique().to_frame().reset_index()
#I'm only going to look at the specialities where the number of doctors for this is above 30
grp30 = grp[grp['npi']>=30]
#Groupby function to only find the specialities who have > 30 docs both recieving & not recieving payments
both = grp30.groupby(['specialty_description'])['recieved_payments'].count().to_frame().reset_index()
blist = list(both[both['recieved_payments']==2]['specialty_description'])

In [232]:
0.05/len(blist)/2

0.0008064516129032258

In [233]:
"""Using a for loop to go thorugh all the specialites that have more than 30 people reicieving & not recieiving
payments to see if there's a significant difference in the means between them
"""
for spec in blist:
    df = s13[s13['specialty_description']==spec].groupby(['npi','recieved_payments']).agg({'amount_brand':'sum','total_claim_count':'sum'})
    df['%_brand'] = (df['amount_brand']/df['total_claim_count'])
    df = df.reset_index()
    paid = df[df['recieved_payments']==True]
    np = df[df['recieved_payments']==False]
    #Making sure I have more than 1 sample
    if (len(np)-1 > 0) & (len(paid)-1 > 0) :
        x, y = (ttest_ind(paid['%_brand'], np['%_brand'], equal_var = False))
        """
        This is a 2 tailed t-test so we'll be looking at 1/2 of our p-value, also since we are running
        so many t-tests the probability of me encountering a Type I eroor increases greatly so I'm also going to use
        a Bonferroni correction (new_sig_level = sig_level(0.05)/# tests)
        """
        if y <= (0.05/len(blist)/2) or y >= (1-(0.05/len(blist)/2)):
            print("{}: t-stat={}, pvalue={}".format(spec,x,y))
            print("         {} paid, {} not paid".format(len(paid),len(np)))

Dermatology: t-stat=3.501925811988889, pvalue=0.0005242821301110622
         262 paid, 101 not paid
Family Practice: t-stat=7.25842716397448, pvalue=7.061001172886413e-13
         927 paid, 719 not paid
Internal Medicine: t-stat=8.566627068969058, pvalue=1.9861614323018996e-17
         2034 paid, 1351 not paid
Neurology: t-stat=3.863386913506997, pvalue=0.00016712012461033476
         286 paid, 98 not paid
Obstetrics/Gynecology: t-stat=4.645070362039651, pvalue=4.6920241438591465e-06
         582 paid, 247 not paid
Ophthalmology: t-stat=6.277403601100644, pvalue=1.1175381702472372e-09
         375 paid, 187 not paid

In [28]:
#Looking at dentists becuase of my background
den = s13[s13['specialty_description']=='Dentist'].groupby(['recieved_payments']).agg({"npi": lambda x: x.nunique(),'amount_brand':'sum','total_claim_count':'sum'})
den['%_brand'] = (den['amount_brand']/den['total_claim_count'])
den

                    npi  amount_brand  total_claim_count   %_brand
recieved_payments
False              2192          1383             100639  0.013742
True                746           703              43587  0.016129

In [44]:
dentists = s13[s13['specialty_description']=='Dentist'].groupby(['npi','recieved_payments']).agg({'amount_brand':'sum','total_claim_count':'sum'})
dentists['%_brand'] = (dentists['amount_brand']/dentists['total_claim_count'])
dentists.reset_index(inplace=True)
dentists.head(2)

          npi  recieved_payments  amount_brand  total_claim_count  %_brand
0  1003019910              False             0                229      0.0
1  1003025503              False             0                 16      0.0

In [14]:
from scipy.stats import ttest_ind

## **<font color='purple'>Dentists = Not a significant diff</font>**

In [95]:

dpaid = dentists[dentists['recieved_payments']==True]
dnp = dentists[dentists['recieved_payments']==False]
print(len(dpaid),len(dnp))
print(ttest_ind(dpaid['%_brand'], dnp['%_brand'], equal_var = False))

746 2192
Ttest_indResult(statistic=0.3113186108872277, pvalue=0.7556123258752613)

In [30]:
im = s13[s13['specialty_description']=='Internal Medicine'].groupby(['recieved_payments']).agg({"npi": lambda x: x.nunique(),'amount_brand':'sum','total_claim_count':'sum'})
im['%_brand'] = (im['amount_brand']/im['total_claim_count'])
im

                    npi  amount_brand  total_claim_count   %_brand
recieved_payments
False              1351        468803            2618932  0.179005
True               2034       1958161            9109833  0.214950

In [45]:
internal = s13[s13['specialty_description']=='Internal Medicine'].groupby(['npi','recieved_payments']).agg({'amount_brand':'sum','total_claim_count':'sum'})
internal['%_brand'] = (internal['amount_brand']/internal['total_claim_count'])
internal.reset_index(inplace=True)
internal.head(2)

          npi  recieved_payments  amount_brand  total_claim_count   %_brand
0  1003020975              False           156               1205  0.129461
1  1003041062              False            12                174  0.068966

## **<font color='blue'>Internal Medicine = Significant Difference </font>**
Large T score = Significantly different

Very small p-value, can reject null hypothesis

In [94]:
impaid = internal[internal['recieved_payments']==True]
imnp = internal[internal['recieved_payments']==False]
print(len(impaid),len(imnp))
#Checking if im-paid mean of % brand subscribed > im-not_paid
print(ttest_ind(impaid['%_brand'], imnp['%_brand'], equal_var = False))

2034 1351
Ttest_indResult(statistic=8.566627068969058, pvalue=1.9861614323018996e-17)

In [27]:
cs = s13[s13['specialty_description']=='Cardiac Surgery'].groupby(['recieved_payments']).agg({"npi": lambda x: x.nunique(),'amount_brand':'sum','total_claim_count':'sum'})
cs['%_brand'] = (cs['amount_brand']/cs['total_claim_count'])
cs

                   npi  amount_brand  total_claim_count   %_brand
recieved_payments
False                2             0                 24  0.000000
True                14          1309               9023  0.145074

In [26]:
card = s13[s13['specialty_description']=='Cardiac Surgery'].groupby(['npi','recieved_payments']).agg({'amount_brand':'sum','total_claim_count':'sum'})
card['%_brand'] = (card['amount_brand']/card['total_claim_count'])
card.reset_index(inplace=True)
card.head(2)

          npi  recieved_payments  amount_brand  total_claim_count  %_brand
0  1013918416               True             0                 27      0.0
1  1023216660              False             0                 13      0.0

## **<font color='blue'>Cardiac Surgery = Significant Difference </font>**
Large T score = Significantly different

Very small p-value, can reject null hypothesis

In [93]:
cpaid = card[card['recieved_payments']==True]
cnp = card[card['recieved_payments']==False]
print(len(cpaid),len(cnp))
#Checking if im-paid mean of % brand subscribed > im-not_paid
print(ttest_ind(cpaid['%_brand'], cnp['%_brand'], equal_var = False))

2034 1351
Ttest_indResult(statistic=8.566627068969058, pvalue=1.9861614323018996e-17)

Interesting, for Diagnostic Radiology I got a negative statistic meaning doctors in this specialty are
LESS likey to prescribe brand name drugs if they are paid

In [140]:
scriptsnj13.groupby('recieved_payments')['npi'].nunique()

recieved_payments
False    11218
True     11267
Name: npi, dtype: int64

In [139]:
scriptsnj14.groupby('recieved_payments')['npi'].nunique()

recieved_payments
False     9727
True     13539
Name: npi, dtype: int64

In [138]:
scriptsnj15.groupby('recieved_payments')['npi'].nunique()

recieved_payments
False    10192
True     13721
Name: npi, dtype: int64

In [151]:
script = s13.groupby(['npi','nppes_provider_first_name','nppes_provider_last_org_name','recieved_payments','specialty_description'],as_index=False).agg({'total_claim_count':'sum','amount_brand':'sum'})
script['%_brand'] = (script['amount_brand']/script['total_claim_count'])

In [152]:
pay = p13.groupby('npi',as_index=False).agg({'payment_id':'count','amount':'sum'})

In [187]:
w = script.merge(pay,on='npi',how='left')

In [168]:
w.head(2)

,npi,nppes_provider_first_name,nppes_provider_last_org_name,recieved_payments,specialty_description,total_claim_count,amount_brand,%_brand,payment_id,amount
0,1003002072,ALEXANDER,GOTESMAN,True,Urology,237,123,0.518987,2.0,28.23
1,1003002858,AMY,GIBSON,False,Nurse Practitioner,1793,327,0.182376,NaN,NaN

In [188]:
w.rename({'nppes_provider_first_name':'fn','nppes_provider_last_org_name':'ln','payment_id':'num_payments','specialty_description':'specialty'},axis='columns',inplace=True)

In [189]:
w.fillna(0,inplace=True)

In [190]:
w.head(2)

,npi,fn,ln,recieved_payments,specialty,total_claim_count,amount_brand,%_brand,num_payments,amount
0,1003002072,ALEXANDER,GOTESMAN,True,Urology,237,123,0.518987,2.0,28.23
1,1003002858,AMY,GIBSON,False,Nurse Practitioner,1793,327,0.182376,0.0,0.00

In [191]:
w = w[w['recieved_payments']==True]

In [192]:
w.to_csv('/Users/kunal/Downloads/pay_script_13.csv',index=False)

In [196]:
scriptsnjfull.head(2)

,npi,nppes_provider_last_org_name,nppes_provider_first_name,nppes_provider_city,nppes_provider_state,specialty_description,year,recieved_payments,total_claim_count,amount_brand,drug_name,generic_name,brand_drug?,total_day_supply,total_drug_cost
0,1528036670,LANTERI,VINCENT,MAYWOOD,NJ,Urology,2013,True,48,48,VIAGRA,SILDENAFIL,True,1481,8957.33
1,1528036670,LANTERI,VINCENT,MAYWOOD,NJ,Urology,2013,True,16,0,CLOTRIMAZOLE BETAMETHASONE,CLOTRIMAZOLE BETAMETHASONE,False,367,806.59

In [203]:
paymentsnjfull.head(2)

,payment_id,npi,fn,ln,address,city,state,zip,specialty,company_id,...,name_d2,name_d3,name_d4,name_d5,ndc_d1,ndc_d2,ndc_d3,ndc_d4,ndc_d5,year
0,235088.0,1174629083,FATIMA,ASGHAR,94 OLD SHORT HILLS RD,LIVINGSTON,NJ,07039,Allopathic & Osteopathic Physicians|Internal M...,100000005529,...,NaN,NaN,NaN,NaN,0456120130,NaN,NaN,NaN,NaN,2013
1,334868.0,1386735850,RAGHUVEER,ANNAM,290 RED SCHOOL LN,PHILLIPSBURG,NJ,08865,Allopathic & Osteopathic Physicians|Internal M...,100000005529,...,NaN,NaN,NaN,NaN,0456120130,NaN,NaN,NaN,NaN,2013

In [202]:
script = scriptsnjfull.groupby(['year','npi','nppes_provider_first_name','nppes_provider_last_org_name','recieved_payments','specialty_description'],as_index=False).agg({'total_claim_count':'sum','amount_brand':'sum'})
script['%_brand'] = (script['amount_brand']/script['total_claim_count'])

In [204]:
pay = paymentsnjfull.groupby(['year','npi'],as_index=False).agg({'payment_id':'count','amount':'sum'})

In [205]:
pay_script = script.merge(pay,on=['year','npi'],how='left')

In [209]:
pay_script.rename({'nppes_provider_first_name':'fn','nppes_provider_last_org_name':'ln','payment_id':'num_payments','specialty_description':'specialty'},axis='columns',inplace=True)
pay_script.fillna(0,inplace=True)

In [214]:
pay_script['amount_generic'] = (pay_script['total_claim_count']-pay_script['amount_brand'])

In [216]:
pay_script.to_csv('/Users/kunal/Downloads/pay_script_full.csv',index=False)

In [217]:
pay_script_t = pay_script[pay_script['recieved_payments']==True]

In [218]:
pay_script_t.to_csv('/Users/kunal/Downloads/pay_script_full_onlypaid.csv',index=False)

In [219]:
pay_script_t.head()

,year,npi,fn,ln,recieved_payments,specialty,total_claim_count,amount_brand,%_brand,num_payments,amount,amount_generic
0,2013,1003002072,ALEXANDER,GOTESMAN,True,Urology,237,123,0.518987,2.0,28.23,114
8,2013,1003029836,THOMAS,MUELLER,True,Urology,832,242,0.290865,26.0,2451.22,590
10,2013,1003034034,SUSAN,GORDON,True,Ophthalmology,1033,413,0.399806,5.0,58.12,620
14,2013,1003046889,VASILIKI,PAPATHANASIOU,True,Family Practice,263,0,0.000000,3.0,4.71,263
17,2013,1003054552,CATHLEEN,SAROS,True,Family Practice,513,25,0.048733,5.0,60.38,488

In [2]:
import pandas as pd
import numpy as np
paid = pd.read_csv('/Users/kunal/Downloads/pay_script_full_onlypaid.csv',dtype={'npi':object})

In [3]:
paid.head(2)

,year,npi,fn,ln,recieved_payments,specialty,total_claim_count,amount_brand,%_brand,num_payments,amount,amount_generic
0,2013,1003002072,ALEXANDER,GOTESMAN,True,Urology,237,123,0.518987,2.0,28.23,114
1,2013,1003029836,THOMAS,MUELLER,True,Urology,832,242,0.290865,26.0,2451.22,590

In [24]:
x = paid.groupby('npi')['year'].nunique().to_frame().reset_index().sort_values('year',ascending=False)
x3 = x[x['year']==3]

In [30]:
x3.sort_values(by='npi')

,year,npi,fn,ln,recieved_payments,specialty,total_claim_count,amount_brand,%_brand,num_payments,amount,amount_generic
0,2013,1003002072,ALEXANDER,GOTESMAN,True,Urology,237,123,0.518987,2.0,28.23,114
11267,2014,1003002072,ALEXANDER,GOTESMAN,True,Urology,997,269,0.269809,19.0,1557.93,728
24806,2015,1003002072,ALEXANDER,GOTESMAN,True,Urology,1526,346,0.226737,31.0,1683.26,1180
4616,2013,1417915968,THADDEUS,AVERSA,True,Internal Medicine,10945,1974,0.180356,10.0,310.72,8971
16824,2014,1417915968,THADDEUS,AVERSA,True,Internal Medicine,10703,1924,0.179763,12.0,337.73,8779
30422,2015,1417915968,THADDEUS,AVERSA,True,Internal Medicine,11279,1582,0.140261,10.0,244.12,9697
4617,2013,1417916131,DAVID,STEWART,True,Internal Medicine,2081,389,0.186929,3.0,315.22,1692
16825,2014,1417916131,DAVID,STEWART,True,Internal Medicine,1774,311,0.175310,11.0,1186.68,1463
30423,2015,1417916131,DAVID,STEWART,True,Internal Medicine,1604,245,0.152743,12.0,1098.51,1359
4619,2013,1417919051,SAIDA,BAXT,True,Dermatology,156,0,0.000000,23.0,10988.58,156
16831,2014,1417919051,SAIDA,BAXT,True,Dermatology,166,11,0.066265,22.0,14529.83,155
30429,2015,1417919051,SAIDA,BAXT,True,Dermatology,153,11,0.071895,15.0,9089.90,142
8650,2013,1770553042,STEVE,COZAMANIS,True,Internal Medicine,647,60,0.092736,8.0,116.50,587
21654,2014,1770553042,STEVE,COZAMANIS,True,Internal Medicine,1568,208,0.132653,67.0,937.54,1360
35340,2015,1770553042,STEVE,COZAMANIS,True,Internal Medicine,1150,118,0.102609,10.0,426.94,1032

In [9]:
paid = pd.read_csv('/Volumes/Seagate/Galvanize/nj_payments_all_years_consl.csv',
                            dtype={'zip':object,'npi':object,'company_id':object}, \
                  usecols=[1,2,3,10,11,12,13,26])

In [10]:
paid[paid['npi']=='1386735850'].groupby('year')['amount'].sum()

year
2013    661.89
2014     77.82
2015     41.95
Name: amount, dtype: float64

In [146]:
#Reading the csv that we saved, The NDCs have to be read as objects becuase otherwise the leading 0s get cut
paymentsnjfull = pd.read_csv('/Volumes/Seagate/Galvanize/nj_payments_all_years_consl.csv',
                            dtype={'zip':object,'name_d1':object,'name_d5':object,'ndc_d1':object,'ndc_d2':object, \
                                   'ndc_d3':object, 'ndc_d4':object,'ndc_d5':object, 'npi':object,'company_id':object, \
                                  'payment_id':object,'record_id':object})

In [147]:
paymentsnjfull.head(2)

,payment_id,npi,fn,ln,address,city,state,zip,specialty,company_id,...,name_d2,name_d3,name_d4,name_d5,ndc_d1,ndc_d2,ndc_d3,ndc_d4,ndc_d5,year
0,235088.0,1174629083,FATIMA,ASGHAR,94 OLD SHORT HILLS RD,LIVINGSTON,NJ,07039,Allopathic & Osteopathic Physicians|Internal M...,100000005529,...,NaN,NaN,NaN,NaN,0456120130,NaN,NaN,NaN,NaN,2013
1,334868.0,1386735850,RAGHUVEER,ANNAM,290 RED SCHOOL LN,PHILLIPSBURG,NJ,08865,Allopathic & Osteopathic Physicians|Internal M...,100000005529,...,NaN,NaN,NaN,NaN,0456120130,NaN,NaN,NaN,NaN,2013

In [148]:
paymentsnjfull.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 927016 entries, 0 to 927015
Data columns (total 27 columns):
payment_id    927016 non-null object
npi           927016 non-null object
fn            927016 non-null object
ln            927016 non-null object
address       927016 non-null object
city          927016 non-null object
state         927016 non-null object
zip           927016 non-null object
specialty     925719 non-null object
company_id    927016 non-null object
company       927016 non-null object
amount        927016 non-null float64
form          927016 non-null object
nature        927016 non-null object
phys_owns     927016 non-null object
record_id     927016 non-null object
name_d1       771821 non-null object
name_d2       199702 non-null object
name_d3       59622 non-null object
name_d4       9082 non-null object
name_d5       3035 non-null object
ndc_d1        659313 non-null object
ndc_d2        173729 non-null object
ndc_d3        53134 non-null object
ndc_d4        7967 non-null object
ndc_d5        2992 non-null object
year          927016 non-null int64
dtypes: float64(1), int64(1), object(25)
memory usage: 191.0+ MB

In [152]:
p = paymentsnjfull[['npi','fn','ln','company','amount','year']]

In [153]:
p.head()

          npi         fn         ln                 company  amount  year
0  1174629083     FATIMA     ASGHAR  FOREST PHARMACEUTICALS   14.83  2013
1  1386735850  RAGHUVEER      ANNAM  FOREST PHARMACEUTICALS   72.90  2013
2  1659372829     DEEPAK       AMIN  FOREST PHARMACEUTICALS    1.39  2013
3  1659372829     DEEPAK       AMIN  FOREST PHARMACEUTICALS    1.40  2013
4  1912047754     AURORA  ANDREESCU  FOREST PHARMACEUTICALS   13.38  2013

In [164]:
x = p.groupby(['npi','fn','ln','year','company']).agg({'amount':'sum'}).reset_index()

In [173]:
xname = x[x['npi']=='1922188184']
#This guy has a shit ton of payments so just to test out graphing

In [178]:
xname.head(2)

               npi       fn       ln  year        company  amount
231035  1922188184  JEFFREY  FARNESE  2013         ABBVIE  135.25
231036  1922188184  JEFFREY  FARNESE  2013  AMARIN PHARMA   30.82

In [186]:
tb = pd.pivot_table(xname, index=['year'],columns='company',values=['amount']).reset_index()
tb.fillna(value=0,inplace=True)
tb.columns = tb.columns.droplevel()
tb.columns = ['year']+list(tb.columns)[1:]

In [188]:
tb

,year,ABBVIE,ACTAVIS PHARMA,AMARIN PHARMA,ARBOR PHARMACEUTICALS,ASTELLAS PHARMA US,ASTRAZENECA PHARMACEUTICALS,AUXILIUM PHARMACEUTICALS,AVANIR PHARMACEUTICALS,BOEHRINGER INGELHEIM PHARMACEUTICALS,...,PFIZER,PURDUE PHARMA,SANOFIAVENTIS US,SUNOVION PHARMACEUTICALS,SUPERNUS PHARMACEUTICALS,TAKEDA PHARMACEUTICALS AMERICA,TEVA PHARMACEUTICALS USA,UPSHERSMITH LABORATORIES,VIVUS,WARNER CHILCOTT
0,2013,98.030,17.220,30.820,0.00,10.24,37.970,98.55,22.48,36.335,...,98.795,11.120,18.180,0.00,14.51,129.790,0.000,0.00,30.710,15.39
1,2014,313.320,39.910,42.375,39.62,23.31,492.600,60.31,293.38,42.285,...,33.225,60.370,50.475,12.06,42.02,100.030,24.770,17.07,74.420,0.00
2,2015,199.235,76.095,17.200,62.12,22.83,435.075,0.00,106.44,120.005,...,141.080,104.775,17.290,37.61,20.83,251.075,103.555,11.98,43.295,0.00

In [190]:
paid = pd.read_csv('/Volumes/Seagate/Galvanize/nj_payments_all_years_consl.csv',
                            dtype={'zip':object,'npi':object,'company_id':object}, \
                  usecols=[1,2,3,4,5,6,7,8,10,11,12,13,26])

In [201]:
#Just replace the npi here for the doctor you're searching for
x = paid[paid['npi']=='1922188184'].groupby(['npi','fn','ln','year','company']).agg({'amount':'sum'}).reset_index()
tb = pd.pivot_table(x, index=['year'],columns='company',values=['amount']).reset_index()
tb.columns = tb.columns.droplevel()
tb.columns = ['year']+list(tb.columns)[1:]

In [203]:
x = tb[tb.columns[0]].to_frame()
x.drop('year',axis=1,inplace=True)

In [204]:
for i in range(len(tb.columns)):
    x[tb.columns[i]] = tb[tb.columns[i]]

In [205]:
x.head()

,year,ABBVIE,ACTAVIS PHARMA,AMARIN PHARMA,ARBOR PHARMACEUTICALS,ASTELLAS PHARMA US,ASTRAZENECA PHARMACEUTICALS,AUXILIUM PHARMACEUTICALS,AVANIR PHARMACEUTICALS,BOEHRINGER INGELHEIM PHARMACEUTICALS,...,PFIZER,PURDUE PHARMA,SANOFIAVENTIS US,SUNOVION PHARMACEUTICALS,SUPERNUS PHARMACEUTICALS,TAKEDA PHARMACEUTICALS AMERICA,TEVA PHARMACEUTICALS USA,UPSHERSMITH LABORATORIES,VIVUS,WARNER CHILCOTT
0,2013,98.030,17.220,30.820,NaN,10.24,37.970,98.55,22.48,36.335,...,98.795,11.120,18.180,NaN,14.51,129.790,NaN,NaN,30.710,15.39
1,2014,313.320,39.910,42.375,39.62,23.31,492.600,60.31,293.38,42.285,...,33.225,60.370,50.475,12.06,42.02,100.030,24.770,17.07,74.420,NaN
2,2015,199.235,76.095,17.200,62.12,22.83,435.075,NaN,106.44,120.005,...,141.080,104.775,17.290,37.61,20.83,251.075,103.555,11.98,43.295,NaN

In [50]:
paid = pd.read_csv('/Volumes/Seagate/Galvanize/nj_payments_all_years_consl.csv',
                            dtype={'zip':object,'name_d1':object,'name_d5':object,'ndc_d1':object,'ndc_d2':object, \
                                   'ndc_d3':object, 'ndc_d4':object,'ndc_d5':object, 'npi':object,'company_id':object, \
                                  'payment_id':object,'record_id':object})

In [51]:
paid.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 927016 entries, 0 to 927015
Data columns (total 27 columns):
payment_id    927016 non-null object
npi           927016 non-null object
fn            927016 non-null object
ln            927016 non-null object
address       927016 non-null object
city          927016 non-null object
state         927016 non-null object
zip           927016 non-null object
specialty     925719 non-null object
company_id    927016 non-null object
company       927016 non-null object
amount        927016 non-null float64
form          927016 non-null object
nature        927016 non-null object
phys_owns     927016 non-null object
record_id     927016 non-null object
name_d1       771821 non-null object
name_d2       199702 non-null object
name_d3       59622 non-null object
name_d4       9082 non-null object
name_d5       3035 non-null object
ndc_d1        659313 non-null object
ndc_d2        173729 non-null object
ndc_d3        53134 non-null object
ndc_d4        7967 non-null object
ndc_d5        2992 non-null object
year          927016 non-null int64
dtypes: float64(1), int64(1), object(25)
memory usage: 191.0+ MB

In [72]:
paid = pd.read_csv('/Volumes/Seagate/Galvanize/nj_payments_all_years_consl.csv',
                            dtype={'zip':object,'npi':object,'company_id':object}, \
                  usecols=[1,2,3,4,5,6,7,8,10,11,12,13,26])

In [54]:
doc_df = paid[paid['npi']==str(1922188184)].groupby(['npi','fn','ln','year','company']).agg({'amount':'sum'}).reset_index()

In [56]:
tb = pd.pivot_table(doc_df, index=['year'],columns='company',values=['amount']).reset_index()

In [59]:
by_company = tb.copy()

In [60]:
by_company.columns = by_company.columns.droplevel()
by_company.columns = ['year']+list(by_company.columns)[1:]

In [61]:
by_company

,year,ABBVIE,ACTAVIS PHARMA,AMARIN PHARMA,ARBOR PHARMACEUTICALS,ASTELLAS PHARMA US,ASTRAZENECA PHARMACEUTICALS,AUXILIUM PHARMACEUTICALS,AVANIR PHARMACEUTICALS,BOEHRINGER INGELHEIM PHARMACEUTICALS,...,PFIZER,PURDUE PHARMA,SANOFIAVENTIS US,SUNOVION PHARMACEUTICALS,SUPERNUS PHARMACEUTICALS,TAKEDA PHARMACEUTICALS AMERICA,TEVA PHARMACEUTICALS USA,UPSHERSMITH LABORATORIES,VIVUS,WARNER CHILCOTT
0,2013,98.030,17.220,30.820,NaN,10.24,37.970,98.55,22.48,36.335,...,98.795,11.120,18.180,NaN,14.51,129.790,NaN,NaN,30.710,15.39
1,2014,313.320,39.910,42.375,39.62,23.31,492.600,60.31,293.38,42.285,...,33.225,60.370,50.475,12.06,42.02,100.030,24.770,17.07,74.420,NaN
2,2015,199.235,76.095,17.200,62.12,22.83,435.075,NaN,106.44,120.005,...,141.080,104.775,17.290,37.61,20.83,251.075,103.555,11.98,43.295,NaN

In [62]:
paid.head(2)

,npi,fn,ln,address,city,state,zip,specialty,company,amount,form,nature,year
0,1174629083,FATIMA,ASGHAR,94 OLD SHORT HILLS RD,LIVINGSTON,NJ,07039,Allopathic & Osteopathic Physicians|Internal M...,FOREST PHARMACEUTICALS,14.83,In-kind items and services,Food and Beverage,2013
1,1386735850,RAGHUVEER,ANNAM,290 RED SCHOOL LN,PHILLIPSBURG,NJ,08865,Allopathic & Osteopathic Physicians|Internal M...,FOREST PHARMACEUTICALS,72.90,In-kind items and services,Food and Beverage,2013

In [63]:
len(by_company.columns)

41

In [90]:
df = pd.read_csv('/Users/kunal/Downloads/pay_script_full_onlypaid.csv',dtype={'npi':object})
df = df.iloc[:,:5]
df.head(2)

   year         npi         fn        ln  recieved_payments
0  2013  1003002072  ALEXANDER  GOTESMAN               True
1  2013  1003029836     THOMAS   MUELLER               True

In [77]:
def makelist(df):
    l =[]
    for i in range(len(df.columns)):
        l.append(df.iloc[:,i])
    return l

In [89]:
makelist(paid.iloc[:,:2])

[0         1174629083
 1         1386735850
 2         1659372829
 3         1659372829
 4         1912047754
 5         1073624698
 6         1225036866
 7         1568400752
 8         1568400752
 9         1174524045
 10        1972527950
 11        1972527950
 12        1972527950
 13        1255407367
 14        1518920925
 15        1184937930
 16        1689658460
 17        1386726230
 18        1184792814
 19        1306838305
 20        1043263916
 21        1114985942
 22        1205842473
 23        1912960436
 24        1720004021
 25        1669523445
 26        1801943303
 27        1841215969
 28        1922075373
 29        1922075373
              ...
 926986    1366494486
 926987    1063608065
 926988    1063608065
 926989    1164422788
 926990    1841233418
 926991    1841233418
 926992    1841222502
 926993    1841222502
 926994    1841222502
 926995    1841222502
 926996    1841222502
 926997    1841222502
 926998    1841222502
 926999    1841222502
 927000    1851585863
 927001    1427020718
 927002    1427020718
 927003    1801942644
 927004    1801942644
 927005    1801942644
 927006    1801942644
 927007    1619900586
 927008    1376635458
 927009    1285611426
 927010    1285611426
 927011    1285611426
 927012    1285611426
 927013    1285611426
 927014    1285611426
 927015    1437198009
 Name: npi, Length: 927016, dtype: object, 0            FATIMA
 1         RAGHUVEER
 2            DEEPAK
 3            DEEPAK
 4            AURORA
 5          JEBAMONI
 6            DONALD
 7           EUGENIA
 8           EUGENIA
 9          EMMANUEL
 10           MAZHAR
 11           MAZHAR
 12           MAZHAR
 13            CAROL
 14         CRISTIAN
 15            ANILA
 16             PAUL
 17            JOVEN
 18          BARBARA
 19        CHRISTIAN
 20             MARK
 21           SANDRA
 22             JOHN
 23             LISA
 24            JERRY
 25          TIMOTHY
 26            ERICA
 27              ELI
 28          MICHAEL
 29          MICHAEL
             ...
 926986       JOSEPH
 926987        FLOYD
 926988        FLOYD
 926989        GLENN
 926990      ADRIANA
 926991      ADRIANA
 926992          JAI
 926993          JAI
 926994          JAI
 926995          JAI
 926996          JAI
 926997          JAI
 926998          JAI
 926999          JAI
 927000       RAJESH
 927001      DOUGLAS
 927002      DOUGLAS
 927003    RAVISHANK
 927004    RAVISHANK
 927005    RAVISHANK
 927006    RAVISHANK
 927007       SHAWNA
 927008    JEANNETTE
 927009       THOMAS
 927010       THOMAS
 927011       THOMAS
 927012       THOMAS
 927013       THOMAS
 927014       THOMAS
 927015      RODOLFO
 Name: fn, Length: 927016, dtype: object]

In [87]:
[paid.npi, paid.fn]

[0         1174629083
 1         1386735850
 2         1659372829
 3         1659372829
 4         1912047754
 5         1073624698
 6         1225036866
 7         1568400752
 8         1568400752
 9         1174524045
 10        1972527950
 11        1972527950
 12        1972527950
 13        1255407367
 14        1518920925
 15        1184937930
 16        1689658460
 17        1386726230
 18        1184792814
 19        1306838305
 20        1043263916
 21        1114985942
 22        1205842473
 23        1912960436
 24        1720004021
 25        1669523445
 26        1801943303
 27        1841215969
 28        1922075373
 29        1922075373
              ...
 926986    1366494486
 926987    1063608065
 926988    1063608065
 926989    1164422788
 926990    1841233418
 926991    1841233418
 926992    1841222502
 926993    1841222502
 926994    1841222502
 926995    1841222502
 926996    1841222502
 926997    1841222502
 926998    1841222502
 926999    1841222502
 927000    1851585863
 927001    1427020718
 927002    1427020718
 927003    1801942644
 927004    1801942644
 927005    1801942644
 927006    1801942644
 927007    1619900586
 927008    1376635458
 927009    1285611426
 927010    1285611426
 927011    1285611426
 927012    1285611426
 927013    1285611426
 927014    1285611426
 927015    1437198009
 Name: npi, Length: 927016, dtype: object, 0            FATIMA
 1         RAGHUVEER
 2            DEEPAK
 3            DEEPAK
 4            AURORA
 5          JEBAMONI
 6            DONALD
 7           EUGENIA
 8           EUGENIA
 9          EMMANUEL
 10           MAZHAR
 11           MAZHAR
 12           MAZHAR
 13            CAROL
 14         CRISTIAN
 15            ANILA
 16             PAUL
 17            JOVEN
 18          BARBARA
 19        CHRISTIAN
 20             MARK
 21           SANDRA
 22             JOHN
 23             LISA
 24            JERRY
 25          TIMOTHY
 26            ERICA
 27              ELI
 28          MICHAEL
 29          MICHAEL
             ...
 926986       JOSEPH
 926987        FLOYD
 926988        FLOYD
 926989        GLENN
 926990      ADRIANA
 926991      ADRIANA
 926992          JAI
 926993          JAI
 926994          JAI
 926995          JAI
 926996          JAI
 926997          JAI
 926998          JAI
 926999          JAI
 927000       RAJESH
 927001      DOUGLAS
 927002      DOUGLAS
 927003    RAVISHANK
 927004    RAVISHANK
 927005    RAVISHANK
 927006    RAVISHANK
 927007       SHAWNA
 927008    JEANNETTE
 927009       THOMAS
 927010       THOMAS
 927011       THOMAS
 927012       THOMAS
 927013       THOMAS
 927014       THOMAS
 927015      RODOLFO
 Name: fn, Length: 927016, dtype: object]

In [12]:
df = pd.DataFrame(['1386735850', 'http://duckduckgo.com'])

def make_clickable(val):
    return '<a href="../../graph/npi/{}">{}</a>'.format(val,val)

df.style.format(make_clickable)

In [13]:
paid

,npi,fn,ln,company,amount,form,nature,year
0,1174629083,FATIMA,ASGHAR,FOREST PHARMACEUTICALS,14.83,In-kind items and services,Food and Beverage,2013
1,1386735850,RAGHUVEER,ANNAM,FOREST PHARMACEUTICALS,72.90,In-kind items and services,Food and Beverage,2013
2,1659372829,DEEPAK,AMIN,FOREST PHARMACEUTICALS,1.39,In-kind items and services,Education,2013
3,1659372829,DEEPAK,AMIN,FOREST PHARMACEUTICALS,1.40,In-kind items and services,Education,2013
4,1912047754,AURORA,ANDREESCU,FOREST PHARMACEUTICALS,13.38,In-kind items and services,Food and Beverage,2013
5,1073624698,JEBAMONI,AMBROSE,FOREST PHARMACEUTICALS,97.16,In-kind items and services,Food and Beverage,2013
6,1225036866,DONALD,AUERBACH,FOREST PHARMACEUTICALS,10.85,In-kind items and services,Food and Beverage,2013
7,1568400752,EUGENIA,BABIAK,FOREST PHARMACEUTICALS,83.73,In-kind items and services,Food and Beverage,2013
8,1568400752,EUGENIA,BABIAK,FOREST PHARMACEUTICALS,97.02,In-kind items and services,Food and Beverage,2013
9,1174524045,EMMANUEL,AYDIN,FOREST PHARMACEUTICALS,14.30,In-kind items and services,Food and Beverage,2013
10,1972527950,MAZHAR,ELAMIR,FOREST PHARMACEUTICALS,1.39,In-kind items and services,Education,2013
11,1972527950,MAZHAR,ELAMIR,FOREST PHARMACEUTICALS,3.00,In-kind items and services,Education,2013
12,1972527950,MAZHAR,ELAMIR,FOREST PHARMACEUTICALS,1.40,In-kind items and services,Education,2013
13,1255407367,CAROL,DOBRZYNSKI,FOREST PHARMACEUTICALS,11.82,In-kind items and services,Food and Beverage,2013
14,1518920925,CRISTIAN,ENESCU,FOREST PHARMACEUTICALS,11.39,In-kind items and services,Food and Beverage,2013
15,1184937930,ANILA,FAIZAN,FOREST PHARMACEUTICALS,16.72,In-kind items and services,Food and Beverage,2013
16,1689658460,PAUL,KAISER,FOREST PHARMACEUTICALS,10.93,In-kind items and services,Food and Beverage,2013
17,1386726230,JOVEN,DUNGO,FOREST PHARMACEUTICALS,1.39,In-kind items and services,Education,2013
18,1184792814,BARBARA,ETHERIDGE,FOREST PHARMACEUTICALS,14.78,In-kind items and services,Food and Beverage,2013
19,1306838305,CHRISTIAN,ELLISON,FOREST PHARMACEUTICALS,11.39,In-kind items and services,Food and Beverage,2013
20,1043263916,MARK,DOMBROWSKI,FOREST PHARMACEUTICALS,120.78,In-kind items and services,Food and Beverage,2013
21,1114985942,SANDRA,ESCANDON,FOREST PHARMACEUTICALS,10.18,In-kind items and services,Food and Beverage,2013
22,1205842473,JOHN,KASPER,FOREST PHARMACEUTICALS,10.67,In-kind items and services,Food and Beverage,2013
23,1912960436,LISA,KASSENOFF,FOREST PHARMACEUTICALS,11.21,In-kind items and services,Food and Beverage,2013
24,1720004021,JERRY,JURADO,FOREST PHARMACEUTICALS,97.03,In-kind items and services,Food and Beverage,2013
25,1669523445,TIMOTHY,DUNN,FOREST PHARMACEUTICALS,2.03,In-kind items and services,Education,2013
26,1801943303,ERICA,ERB,FOREST PHARMACEUTICALS,11.82,In-kind items and services,Food and Beverage,2013
27,1841215969,ELI,DJEBIYAN,FOREST PHARMACEUTICALS,13.00,In-kind items and services,Food and Beverage,2013
28,1922075373,MICHAEL,DISCIGLIO,FOREST PHARMACEUTICALS,92.42,In-kind items and services,Food and Beverage,2013
29,1922075373,MICHAEL,DISCIGLIO,FOREST PHARMACEUTICALS,11.20,In-kind items and services,Food and Beverage,2013
...,...,...,...,...,...,...,...,...
926986,1366494486,JOSEPH,SCHKOLNICK,VALEANT PHARMACEUTICALS NORTH AMERICA,6.42,In-kind items and services,Food and Beverage,2015
926987,1063608065,FLOYD,SMITH,VALEANT PHARMACEUTICALS NORTH AMERICA,16.38,In-kind items and services,Food and Beverage,2015
926988,1063608065,FLOYD,SMITH,VALEANT PHARMACEUTICALS NORTH AMERICA,2.84,In-kind items and services,Food and Beverage,2015
926989,1164422788,GLENN,OSIAS,VALEANT PHARMACEUTICALS NORTH AMERICA,20.62,In-kind items and services,Food and Beverage,2015
926990,1841233418,ADRIANA,PALUMBO,VALEANT PHARMACEUTICALS NORTH AMERICA,22.58,In-kind items and services,Food and Beverage,2015
926991,1841233418,ADRIANA,PALUMBO,VALEANT PHARMACEUTICALS NORTH AMERICA,20.22,In-kind items and services,Food and Beverage,2015
926992,1841222502,JAI,PAREKH,VALEANT PHARMACEUTICALS NORTH AMERICA,23.88,In-kind items and services,Food and Beverage,2015
926993,1841222502,JAI,PAREKH,VALEANT PHARMACEUTICALS NORTH AMERICA,23.06,In-kind items and services,Food and Beverage,2015
926994,1841222502,JAI,PAREKH,VALEANT PHARMACEUTICALS NORTH AMERICA,23.44,In-kind items and services,Food and Beverage,2015
926995,1841222502,JAI,PAREKH,VALEANT PHARMACEUTICALS NORTH AMERICA,20.11,In-kind items and services,Food and Beverage,2015
926996,1841222502,JAI,PAREKH,VALEANT PHARMACEUTICALS NORTH AMERICA,21.61,In-kind items and services,Food and Beverage,2015
926997,1841222502,JAI,PAREKH,VALEANT PHARMACEUTICALS NORTH AMERICA,24.81,In-kind items and services,Food and Beverage,2015
926998,1841222502,JAI,PAREKH,VALEANT PHARMACEUTICALS NORTH AMERICA,23.21,In-kind items and services,Food and Beverage,2015
926999,1841222502,JAI,PAREKH,VALEANT PHARMACEUTICALS NORTH AMERICA,16.31,In-kind items and services,Food and Beverage,2015
927000,1851585863,RAJESH,PATEL,VALEANT PHARMACEUTICALS NORTH AMERICA,27.46,In-kind items and services,Food and Beverage,2015
927001,1427020718,DOUGLAS,PRAVDA,VALEANT PHARMACEUTICALS NORTH AMERICA,13.34,In-kind items and services,Food and Beverage,2015
927002,1427020718,DOUGLAS,PRAVDA,VALEANT PHARMACEUTICALS NORTH AMERICA,16.01,In-kind items and services,Food and Beverage,2015
927003,1801942644,RAVISHANK,RAMAMOORTHY,VALEANT PHARMACEUTICALS NORTH AMERICA,28.57,In-kind items and services,Food and Beverage,2015
927004,1801942644,RAVISHANK,RAMAMOORTHY,VALEANT PHARMACEUTICALS NORTH AMERICA,16.00,In-kind items and services,Food and Beverage,2015
927005,1801942644,RAVISHANK,RAMAMOORTHY,VALEANT PHARMACEUTICALS NORTH AMERICA,17.39,In-kind items and services,Food and Beverage,2015
927006,1801942644,RAVISHANK,RAMAMOORTHY,VALEANT PHARMACEUTICALS NORTH AMERICA,15.07,In-kind items and services,Food and Beverage,2015
927007,1619900586,SHAWNA,REIGEL,VALEANT PHARMACEUTICALS NORTH AMERICA,25.30,In-kind items and services,Food and Beverage,2015
927008,1376635458,JEANNETTE,REILLY,VALEANT PHARMACEUTICALS NORTH AMERICA,14.56,In-kind items and services,Food and Beverage,2015
927009,1285611426,THOMAS,RICH,VALEANT PHARMACEUTICALS NORTH AMERICA,10.11,In-kind items and services,Food and Beverage,2015
927010,1285611426,THOMAS,RICH,VALEANT PHARMACEUTICALS NORTH AMERICA,26.25,In-kind items and services,Food and Beverage,2015
927011,1285611426,THOMAS,RICH,VALEANT PHARMACEUTICALS NORTH AMERICA,1.28,In-kind items and services,Food and Beverage,2015
927012,1285611426,THOMAS,RICH,VALEANT PHARMACEUTICALS NORTH AMERICA,22.10,In-kind items and services,Food and Beverage,2015
927013,1285611426,THOMAS,RICH,VALEANT PHARMACEUTICALS NORTH AMERICA,6.87,In-kind items and services,Food and Beverage,2015
927014,1285611426,THOMAS,RICH,VALEANT PHARMACEUTICALS NORTH AMERICA,22.16,In-kind items and services,Food and Beverage,2015
927015,1437198009,RODOLFO,RODRIGUEZ,VALEANT PHARMACEUTICALS NORTH AMERICA,23.78,In-kind items and services,Food and Beverage,2015

In [59]:
def linkup(x):
    for col in x.index:
        if col == 'npi':
            paid2.at[col,str(x.name)] = '<a href="../../graph/npi/{}">{}</a>'.format(x[col],x[col])
        else:
            paid2.at[col,str(x.name)] = '<a href="../../graph/npi/{}">{}</a>'.format(x['npi'],x[col])

SyntaxError: invalid syntax (<ipython-input-59-29ff3235f59f>, line 4)

In [85]:
def linkup(x):
    for ind in x.index:
        for col in x.columns:
            if col == 'npi':
                x.at[ind,col] = '<a href="../../graph/npi/{}">{}</a>'.format(x.at[ind,col],x.at[ind,col])
            else:
                x.at[ind,col] = ('<a href="../../graph/npi/{}">{}</a>'.format(x.at[ind,'npi'],x.at[ind,col]))

In [86]:
linkup(paid2)

In [83]:
paid = pd.read_csv('/Volumes/Seagate/Galvanize/nj_payments_all_years_consl.csv',
                            dtype={'payment_id':object,'zip':object,'npi':object,'company_id':object}, \
                  usecols=[1,2,3,4,5,6,7,8])

In [104]:
paid = pd.read_csv('/Volumes/Seagate/Galvanize/nj_payments_all_years_consl.csv',nrows=2)

In [89]:
paid2

,npi,fn,ln,address,city,state,zip,specialty
0,"<a href=""../../graph/npi/1174629083"">117462908...","<a href=""../../graph/npi/<a href=""../../graph/...","<a href=""../../graph/npi/<a href=""../../graph/...","<a href=""../../graph/npi/<a href=""../../graph/...","<a href=""../../graph/npi/<a href=""../../graph/...","<a href=""../../graph/npi/<a href=""../../graph/...","<a href=""../../graph/npi/<a href=""../../graph/...","<a href=""../../graph/npi/<a href=""../../graph/..."
1,"<a href=""../../graph/npi/1386735850"">138673585...","<a href=""../../graph/npi/<a href=""../../graph/...","<a href=""../../graph/npi/<a href=""../../graph/...","<a href=""../../graph/npi/<a href=""../../graph/...","<a href=""../../graph/npi/<a href=""../../graph/...","<a href=""../../graph/npi/<a href=""../../graph/...","<a href=""../../graph/npi/<a href=""../../graph/...","<a href=""../../graph/npi/<a href=""../../graph/..."

In [92]:
x = paid2.values.tolist()
x.insert(0,paid2.columns.tolist())

In [102]:
paid = pd.read_csv('/Users/kunal/Downloads/pay_script_full_onlypaid.csv',dtype={'npi':object},usecols=[1,2,3,5,6,7,8], nrows=10)

In [106]:
paid = pd.read_csv('/Volumes/Seagate/Galvanize/nj_payments_all_years_consl.csv',usecols=[1])

In [107]:
paid.head(2)

,npi,fn,ln,address,city,state,zip,specialty
0,1174629083,FATIMA,ASGHAR,94 OLD SHORT HILLS RD,LIVINGSTON,NJ,7039,Allopathic & Osteopathic Physicians|Internal M...
1,1386735850,RAGHUVEER,ANNAM,290 RED SCHOOL LN,PHILLIPSBURG,NJ,8865,Allopathic & Osteopathic Physicians|Internal M...

In [98]:
paid2.at[0,'npi'],paid2.at[0,'fn']

('1003002072', 'ALEXANDER')

In [99]:
'<a href="../../graph/npi/{}">{}</a>'.format(paid2.at[0,'npi'],paid2.at[0,'fn'])

'<a href="../../graph/npi/1003002072">ALEXANDER</a>'

In [100]:
'<a href="../../graph/npi/{}">{}</a>'.format(paid2.at[0,'npi'],paid2.at[0,'npi'])

'<a href="../../graph/npi/1003002072">1003002072</a>'

In [101]:
"<a href='../../graph/npi/{}'>{}</a>"".format(paid2.at[0,'npi'],paid2.at[0,'year'])

'<a href="../../graph/npi/1003002072">2013</a>'

In [135]:
paid = pd.read_csv('/Volumes/Seagate/Galvanize/nj_payments_all_years_consl.csv',dtype={'npi':object},usecols=[1,2])

In [64]:
scriptsnjfull = pd.read_csv('/Volumes/Seagate/Galvanize/nj_scripts_all_years.csv',dtype={'npi':object,'zip':object})

In [149]:
paid_npis = paid.groupby('npi')['fn'].count().to_frame().reset_index()

In [144]:
scripts_npis = scriptsnjfull.groupby('npi')['nppes_provider_last_org_name'].count().to_frame().reset_index().drop('nppes_provider_last_org_name',axis=1)

In [151]:
result = pd.concat([scripts_npis,paid_npis])

In [152]:
len(result)

44016

In [148]:
len(paid_npis),len(scripts_npis),(len(paid_npis)+len(scripts_npis))

(16482, 27534, 44016)

In [205]:
npis = result.groupby('npi')['fn'].count().to_frame().reset_index().drop('fn',axis=1)

In [206]:
npis.head(2)

          npi
0  1003001678
1  1003002072

In [157]:
len(npis)

27534

In [203]:
scriptsnjfull.head()

,npi,ln,fn,city,state,specialty_description,year,recieved_payments,total_claim_count,amount_brand,drug_name,generic_name,brand_drug?,total_day_supply,total_drug_cost
0,1528036670,LANTERI,VINCENT,MAYWOOD,NJ,Urology,2013,True,48,48,VIAGRA,SILDENAFIL,True,1481,8957.33
1,1528036670,LANTERI,VINCENT,MAYWOOD,NJ,Urology,2013,True,16,0,CLOTRIMAZOLE BETAMETHASONE,CLOTRIMAZOLE BETAMETHASONE,False,367,806.59
2,1528036670,LANTERI,VINCENT,MAYWOOD,NJ,Urology,2013,True,27,0,IMIPRAMINE,IMIPRAMINE,False,1380,519.91
3,1528036670,LANTERI,VINCENT,MAYWOOD,NJ,Urology,2013,True,34,0,NITROFURANTOIN,NITROFURANTOIN,False,1480,1502.16
4,1528036670,LANTERI,VINCENT,MAYWOOD,NJ,Urology,2013,True,29,29,ANDROGEL,TESTOSTERONE,True,1236,17234.63

In [169]:
scriptsnjfull.rename(columns=newcols,inplace=True)

In [171]:
scriptsnjfull.to_csv('/Volumes/Seagate/Galvanize/nj_scripts_all_years.csv',index=False)

In [63]:
doc_info = pd.read_csv('/Volumes/Seagate/Galvanize/nj_scripts_all_years.csv',dtype={'npi':object,'zip':object},usecols=[0,1,2,3,4,5])

In [184]:
doc_info = scriptsnjfull.copy()

In [185]:
doc_info.drop(['recieved_payments','total_claim_count','amount_brand','drug_name','generic_name','brand_drug?','total_day_supply','total_drug_cost'],axis=1,inplace=True)

In [187]:
newcols={'npi':'NPI',"fn":'First Name','ln':'Last Name', \
        'city':'City','state':'State','specialty_description':'Specialty Description'}

In [190]:
doc_info.to_csv('/Volumes/Seagate/Galvanize/nj_doc_info.csv',index=False)

In [216]:
doc_info.head(2)

          NPI Last Name First Name     City State Specialty Description  year
0  1528036670   LANTERI    VINCENT  MAYWOOD    NJ               Urology  2013
1  1528036670   LANTERI    VINCENT  MAYWOOD    NJ               Urology  2013

In [252]:
docs = doc_info.groupby(['NPI','Last Name','First Name','City','State','Specialty Description'])['year'].nunique().to_frame().reset_index()

In [245]:
doc_info2=doc_info.copy()
doc_info2.drop(['year','State'],axis=1,inplace=True)

In [248]:
result = docs.merge(doc_info2, how='inner',left_on='NPI',right_on='NPI')

In [253]:
len(docs.NPI.unique()), len(docs)

(27534, 29381)

In [254]:
docs.head()

,NPI,Last Name,First Name,City,State,Specialty Description,year
0,1003001678,EIRICH,REBECCA,TURNERSVILLE,NJ,Nurse Practitioner,1
1,1003002072,GOTESMAN,ALEXANDER,HAMILTON,NJ,Urology,3
2,1003002858,GIBSON,AMY,PLAINFIELD,NJ,Nurse Practitioner,3
3,1003011891,SPIRA,ETAN,BELLEVILLE,NJ,Gastroenterology,2
4,1003012410,TINDOC,LORELANE,CLIFTON,NJ,Family Practice,3

In [215]:
snpi[:1].to_dict('index')

{0: {'Authorized Official Credential Text': nan,
  'Authorized Official First Name': nan,
  'Authorized Official Last Name': nan,
  'Authorized Official Middle Name': nan,
  'Authorized Official Name Prefix Text': nan,
  'Authorized Official Name Suffix Text': nan,
  'Authorized Official Telephone Number': nan,
  'Authorized Official Title or Position': nan,
  'Employer Identification Number (EIN)': nan,
  'Entity Type Code': 1,
  'Healthcare Provider Primary Taxonomy Switch_1': 'Y',
  'Healthcare Provider Primary Taxonomy Switch_10': nan,
  'Healthcare Provider Primary Taxonomy Switch_11': nan,
  'Healthcare Provider Primary Taxonomy Switch_12': nan,
  'Healthcare Provider Primary Taxonomy Switch_13': nan,
  'Healthcare Provider Primary Taxonomy Switch_14': nan,
  'Healthcare Provider Primary Taxonomy Switch_15': nan,
  'Healthcare Provider Primary Taxonomy Switch_2': nan,
  'Healthcare Provider Primary Taxonomy Switch_3': nan,
  'Healthcare Provider Primary Taxonomy Switch_4': nan,
  'Healthcare Provider Primary Taxonomy Switch_5': nan,
  'Healthcare Provider Primary Taxonomy Switch_6': nan,
  'Healthcare Provider Primary Taxonomy Switch_7': nan,
  'Healthcare Provider Primary Taxonomy Switch_8': nan,
  'Healthcare Provider Primary Taxonomy Switch_9': nan,
  'Healthcare Provider Taxonomy Code_1': '207X00000X',
  'Healthcare Provider Taxonomy Code_10': nan,
  'Healthcare Provider Taxonomy Code_11': nan,
  'Healthcare Provider Taxonomy Code_12': nan,
  'Healthcare Provider Taxonomy Code_13': nan,
  'Healthcare Provider Taxonomy Code_14': nan,
  'Healthcare Provider Taxonomy Code_15': nan,
  'Healthcare Provider Taxonomy Code_2': nan,
  'Healthcare Provider Taxonomy Code_3': nan,
  'Healthcare Provider Taxonomy Code_4': nan,
  'Healthcare Provider Taxonomy Code_5': nan,
  'Healthcare Provider Taxonomy Code_6': nan,
  'Healthcare Provider Taxonomy Code_7': nan,
  'Healthcare Provider Taxonomy Code_8': nan,
  'Healthcare Provider Taxonomy Code_9': nan,
  'Healthcare Provider Taxonomy Group_1': nan,
  'Healthcare Provider Taxonomy Group_10': nan,
  'Healthcare Provider Taxonomy Group_11': nan,
  'Healthcare Provider Taxonomy Group_12': nan,
  'Healthcare Provider Taxonomy Group_13': nan,
  'Healthcare Provider Taxonomy Group_14': nan,
  'Healthcare Provider Taxonomy Group_15': nan,
  'Healthcare Provider Taxonomy Group_2': nan,
  'Healthcare Provider Taxonomy Group_3': nan,
  'Healthcare Provider Taxonomy Group_4': nan,
  'Healthcare Provider Taxonomy Group_5': nan,
  'Healthcare Provider Taxonomy Group_6': nan,
  'Healthcare Provider Taxonomy Group_7': nan,
  'Healthcare Provider Taxonomy Group_8': nan,
  'Healthcare Provider Taxonomy Group_9': nan,
  'Is Organization Subpart': nan,
  'Is Sole Proprietor': 'X',
  'Last Update Date': '07/08/2007',
  'NPI': 1679576722,
  'NPI Deactivation Date': nan,
  'NPI Deactivation Reason Code': nan,
  'NPI Reactivation Date': nan,
  'Other Provider Identifier Issuer_1': 'BCBS',
  'Other Provider Identifier Issuer_10': nan,
  'Other Provider Identifier Issuer_11': nan,
  'Other Provider Identifier Issuer_12': nan,
  'Other Provider Identifier Issuer_13': nan,
  'Other Provider Identifier Issuer_14': nan,
  'Other Provider Identifier Issuer_15': nan,
  'Other Provider Identifier Issuer_16': nan,
  'Other Provider Identifier Issuer_17': nan,
  'Other Provider Identifier Issuer_18': nan,
  'Other Provider Identifier Issuer_19': nan,
  'Other Provider Identifier Issuer_2': 'FIRSTGUARD',
  'Other Provider Identifier Issuer_20': nan,
  'Other Provider Identifier Issuer_21': nan,
  'Other Provider Identifier Issuer_22': nan,
  'Other Provider Identifier Issuer_23': nan,
  'Other Provider Identifier Issuer_24': nan,
  'Other Provider Identifier Issuer_25': nan,
  'Other Provider Identifier Issuer_26': nan,
  'Other Provider Identifier Issuer_27': nan,
  'Other Provider Identifier Issuer_28': nan,
  'Other Provider Identifier Issuer_29': nan,
  'Other Provider Identifier Issuer_3': 'BCBS',
  'Other Provider Identifier Issuer_30': nan,
  'Other Provider Identifier Issuer_31': nan,
  'Other Provider Identifier Issuer_32': nan,
  'Other Provider Identifier Issuer_33': nan,
  'Other Provider Identifier Issuer_34': nan,
  'Other Provider Identifier Issuer_35': nan,
  'Other Provider Identifier Issuer_36': nan,
  'Other Provider Identifier Issuer_37': nan,
  'Other Provider Identifier Issuer_38': nan,
  'Other Provider Identifier Issuer_39': nan,
  'Other Provider Identifier Issuer_4': nan,
  'Other Provider Identifier Issuer_40': nan,
  'Other Provider Identifier Issuer_41': nan,
  'Other Provider Identifier Issuer_42': nan,
  'Other Provider Identifier Issuer_43': nan,
  'Other Provider Identifier Issuer_44': nan,
  'Other Provider Identifier Issuer_45': nan,
  'Other Provider Identifier Issuer_46': nan,
  'Other Provider Identifier Issuer_47': nan,
  'Other Provider Identifier Issuer_48': nan,
  'Other Provider Identifier Issuer_49': nan,
  'Other Provider Identifier Issuer_5': nan,
  'Other Provider Identifier Issuer_50': nan,
  'Other Provider Identifier Issuer_6': nan,
  'Other Provider Identifier Issuer_7': nan,
  'Other Provider Identifier Issuer_8': nan,
  'Other Provider Identifier Issuer_9': nan,
  'Other Provider Identifier State_1': 'NE',
  'Other Provider Identifier State_10': nan,
  'Other Provider Identifier State_11': nan,
  'Other Provider Identifier State_12': nan,
  'Other Provider Identifier State_13': nan,
  'Other Provider Identifier State_14': nan,
  'Other Provider Identifier State_15': nan,
  'Other Provider Identifier State_16': nan,
  'Other Provider Identifier State_17': nan,
  'Other Provider Identifier State_18': nan,
  'Other Provider Identifier State_19': nan,
  'Other Provider Identifier State_2': 'KS',
  'Other Provider Identifier State_20': nan,
  'Other Provider Identifier State_21': nan,
  'Other Provider Identifier State_22': nan,
  'Other Provider Identifier State_23': nan,
  'Other Provider Identifier State_24': nan,
  'Other Provider Identifier State_25': nan,
  'Other Provider Identifier State_26': nan,
  'Other Provider Identifier State_27': nan,
  'Other Provider Identifier State_28': nan,
  'Other Provider Identifier State_29': nan,
  'Other Provider Identifier State_3': 'KS',
  'Other Provider Identifier State_30': nan,
  'Other Provider Identifier State_31': nan,
  'Other Provider Identifier State_32': nan,
  'Other Provider Identifier State_33': nan,
  'Other Provider Identifier State_34': nan,
  'Other Provider Identifier State_35': nan,
  'Other Provider Identifier State_36': nan,
  'Other Provider Identifier State_37': nan,
  'Other Provider Identifier State_38': nan,
  'Other Provider Identifier State_39': nan,
  'Other Provider Identifier State_4': nan,
  'Other Provider Identifier State_40': nan,
  'Other Provider Identifier State_41': nan,
  'Other Provider Identifier State_42': nan,
  'Other Provider Identifier State_43': nan,
  'Other Provider Identifier State_44': nan,
  'Other Provider Identifier State_45': nan,
  'Other Provider Identifier State_46': nan,
  'Other Provider Identifier State_47': nan,
  'Other Provider Identifier State_48': nan,
  'Other Provider Identifier State_49': nan,
  'Other Provider Identifier State_5': nan,
  'Other Provider Identifier State_50': nan,
  'Other Provider Identifier State_6': nan,
  'Other Provider Identifier State_7': nan,
  'Other Provider Identifier State_8': nan,
  'Other Provider Identifier State_9': nan,
  'Other Provider Identifier Type Code_1': 1,
  'Other Provider Identifier Type Code_10': nan,
  'Other Provider Identifier Type Code_11': nan,
  'Other Provider Identifier Type Code_12': nan,
  'Other Provider Identifier Type Code_13': nan,
  'Other Provider Identifier Type Code_14': nan,
  'Other Provider Identifier Type Code_15': nan,
  'Other Provider Identifier Type Code_16': nan,
  'Other Provider Identifier Type Code_17': nan,
  'Other Provider Identifier Type Code_18': nan,
  'Other Provider Identifier Type Code_19': nan,
  'Other Provider Identifier Type Code_2': 1,
  'Other Provider Identifier Type Code_20': nan,
  'Other Provider Identifier Type Code_21': nan,
  'Other Provider Identifier Type Code_22': nan,
  'Other Provider Identifier Type Code_23': nan,
  'Other Provider Identifier Type Code_24': nan,
  'Other Provider Identifier Type Code_25': nan,
  'Other Provider Identifier Type Code_26': nan,
  'Other Provider Identifier Type Code_27': nan,
  'Other Provider Identifier Type Code_28': nan,
  'Other Provider Identifier Type Code_29': nan,
  'Other Provider Identifier Type Code_3': 1,
  'Other Provider Identifier Type Code_30': nan,
  'Other Provider Identifier Type Code_31': nan,
  'Other Provider Identifier Type Code_32': nan,
  'Other Provider Identifier Type Code_33': nan,
  'Other Provider Identifier Type Code_34': nan,
  'Other Provider Identifier Type Code_35': nan,
  'Other Provider Identifier Type Code_36': nan,
  'Other Provider Identifier Type Code_37': nan,
  'Other Provider Identifier Type Code_38': nan,
  'Other Provider Identifier Type Code_39': nan,
  'Other Provider Identifier Type Code_4': nan,
  'Other Provider Identifier Type Code_40': nan,
  'Other Provider Identifier Type Code_41': nan,
  'Other Provider Identifier Type Code_42': nan,
  'Other Provider Identifier Type Code_43': nan,
  'Other Provider Identifier Type Code_44': nan,
  'Other Provider Identifier Type Code_45': nan,
  'Other Provider Identifier Type Code_46': nan,
  'Other Provider Identifier Type Code_47': nan,
  'Other Provider Identifier Type Code_48': nan,
  'Other Provider Identifier Type Code_49': nan,
  'Other Provider Identifier Type Code_5': nan,
  'Other Provider Identifier Type Code_50': nan,
  'Other Provider Identifier Type Code_6': nan,
  'Other Provider Identifier Type Code_7': nan,
  'Other Provider Identifier Type Code_8': nan,
  'Other Provider Identifier Type Code_9': nan,
  'Other Provider Identifier_1': 1553,
  'Other Provider Identifier_10': nan,
  'Other Provider Identifier_11': nan,
  'Other Provider Identifier_12': nan,
  'Other Provider Identifier_13': nan,
  'Other Provider Identifier_14': nan,
  'Other Provider Identifier_15': nan,
  'Other Provider Identifier_16': nan,
  'Other Provider Identifier_17': nan,
  'Other Provider Identifier_18': nan,
  'Other Provider Identifier_19': nan,
  'Other Provider Identifier_2': '645540',
  'Other Provider Identifier_20': nan,
  'Other Provider Identifier_21': nan,
  'Other Provider Identifier_22': nan,
  'Other Provider Identifier_23': nan,
  'Other Provider Identifier_24': nan,
  'Other Provider Identifier_25': nan,
  'Other Provider Identifier_26': nan,
  'Other Provider Identifier_27': nan,
  'Other Provider Identifier_28': nan,
  'Other Provider Identifier_29': nan,
  'Other Provider Identifier_3': 46969,
  'Other Provider Identifier_30': nan,
  'Other Provider Identifier_31': nan,
  'Other Provider Identifier_32': nan,
  'Other Provider Identifier_33': nan,
  'Other Provider Identifier_34': nan,
  'Other Provider Identifier_35': nan,
  'Other Provider Identifier_36': nan,
  'Other Provider Identifier_37': nan,
  'Other Provider Identifier_38': nan,
  'Other Provider Identifier_39': nan,
  'Other Provider Identifier_4': nan,
  'Other Provider Identifier_40': nan,
  'Other Provider Identifier_41': nan,
  'Other Provider Identifier_42': nan,
  'Other Provider Identifier_43': nan,
  'Other Provider Identifier_44': nan,
  'Other Provider Identifier_45': nan,
  'Other Provider Identifier_46': nan,
  'Other Provider Identifier_47': nan,
  'Other Provider Identifier_48': nan,
  'Other Provider Identifier_49': nan,
  'Other Provider Identifier_5': nan,
  'Other Provider Identifier_50': nan,
  'Other Provider Identifier_6': nan,
  'Other Provider Identifier_7': nan,
  'Other Provider Identifier_8': nan,
  'Other Provider Identifier_9': nan,
  'Parent Organization LBN': nan,
  'Parent Organization TIN': nan,
  'Provider Business Mailing Address City Name': 'KEARNEY',
  'Provider Business Mailing Address Country Code (If outside U.S.)': 'US',
  'Provider Business Mailing Address Fax Number': 3088652506,
  'Provider Business Mailing Address Postal Code': 688482168,
  'Provider Business Mailing Address State Name': 'NE',
  'Provider Business Mailing Address Telephone Number': 3088652512,
  'Provider Business Practice Location Address City Name': 'KEARNEY',
  'Provider Business Practice Location Address Country Code (If outside U.S.)': 'US',
  'Provider Business Practice Location Address Fax Number': 3088652506,
  'Provider Business Practice Location Address Postal Code': 688472944,
  'Provider Business Practice Location Address State Name': 'NE',
  'Provider Business Practice Location Address Telephone Number': 3088652512,
  'Provider Credential Text': 'M.D.',
  'Provider Enumeration Date': '05/23/2005',
  'Provider First Line Business Mailing Address': 'PO BOX 2168',
  'Provider First Line Business Practice Location Address': '3500 CENTRAL AVE',
  'Provider First Name': 'DAVID',
  'Provider Gender Code': 'M',
  'Provider Last Name (Legal Name)': 'WIEBE',
  'Provider License Number State Code_1': 'NE',
  'Provider License Number State Code_10': nan,
  'Provider License Number State Code_11': nan,
  'Provider License Number State Code_12': nan,
  'Provider License Number State Code_13': nan,
  'Provider License Number State Code_14': nan,
  'Provider License Number State Code_15': nan,
  'Provider License Number State Code_2': nan,
  'Provider License Number State Code_3': nan,
  'Provider License Number State Code_4': nan,
  'Provider License Number State Code_5': nan,
  'Provider License Number State Code_6': nan,
  'Provider License Number State Code_7': nan,
  'Provider License Number State Code_8': nan,
  'Provider License Number State Code_9': nan,
  'Provider License Number_1': '12637',
  'Provider License Number_10': nan,
  'Provider License Number_11': nan,
  'Provider License Number_12': nan,
  'Provider License Number_13': nan,
  'Provider License Number_14': nan,
  'Provider License Number_15': nan,
  'Provider License Number_2': nan,
  'Provider License Number_3': nan,
  'Provider License Number_4': nan,
  'Provider License Number_5': nan,
  'Provider License Number_6': nan,
  'Provider License Number_7': nan,
  'Provider License Number_8': nan,
  'Provider License Number_9': nan,
  'Provider Middle Name': 'A',
  'Provider Name Prefix Text': nan,
  'Provider Name Suffix Text': nan,
  'Provider Organization Name (Legal Business Name)': nan,
  'Provider Other Credential Text': nan,
  'Provider Other First Name': nan,
  'Provider Other Last Name': nan,
  'Provider Other Last Name Type Code': nan,
  'Provider Other Middle Name': nan,
  'Provider Other Name Prefix Text': nan,
  'Provider Other Name Suffix Text': nan,
  'Provider Other Organization Name': nan,
  'Provider Other Organization Name Type Code': nan,
  'Provider Second Line Business Mailing Address': nan,
  'Provider Second Line Business Practice Location Address': nan,
  'Replacement NPI': nan}}

In [255]:
len(npi)

4188312

In [256]:
len(npi['NPI'].unique())

4188312

In [273]:
#Loading in All Npis to make a file of basic info of all NJ docs (the reason I can't use other CSVs I have is some docs have mulitple specialties & such which this will cover)
npi = pd.read_csv('/Volumes/Seagate/Galvanize/NPPES_Data_Dissemination_May_2018/npidata_pfile_20050523-20180513.csv', \
                  usecols=['Entity Type Code','NPI', 'Provider Gender Code', \
                           'Provider First Name','Provider Last Name (Legal Name)', \
                           'Provider Business Practice Location Address Postal Code', \
                           'Provider First Line Business Practice Location Address', \
                           'Provider Business Practice Location Address State Name', \
                           'Provider Credential Text', 'Provider Business Practice Location Address City Name'], \
                           dtype = {'Provider Business Practice Location Address Postal Code':object})

In [274]:
#Grabbing only the individuals from the npi database, so I can remove orgs from the dataframe
npi = npi[npi['Entity Type Code'].isin([1.0])]

In [275]:
npi.drop(['Entity Type Code'],inplace=True,axis=1)

In [282]:
newcols = {'Provider Last Name (Legal Name)':'Last Name','Provider First Name':'First Name', \
           'Provider Credential Text':'Type','Provider First Line Business Practice Location Address':'Address', \
          'Provider Business Practice Location Address State Name':'State','Provider Business Practice Location Address Postal Code':'Zip Code', \
          'Provider Gender Code':'Gender','Provider Business Practice Location Address City Name':'City'}
npi.rename(columns=newcols,inplace=True)

In [283]:
npi = npi[npi['State'].isin(['NJ'])]

In [284]:
npi.head(1)

,NPI,Last Name,First Name,Type,Address,City,State,Zip Code,Gender
30,1477556421,ROTH,STEVEN,O.D.,1107 MANTUA PIKE,MANTUA,NJ,080511606,M

In [285]:
npi2 = npi.copy()

In [286]:
npi['Zip Code'] = npi['Zip Code'].apply(lambda x: x[:5])

In [293]:
#Cleaning up how I want the columns arranged
npi = npi[npi.columns.tolist()[:1]+npi.columns.tolist()[2:3]+ \
          npi.columns.tolist()[1:2] + npi.columns.tolist()[3:4] + \
          npi.columns.tolist()[-1:] + npi.columns.tolist()[4:-1]]

In [290]:
scriptsnjfull.npi.unique()

array(['1528036670', '1699730937', '1346238334', ..., '1942382148',
       '1114265642', '1982689352'], dtype=object)

In [295]:
npi = npi[npi['NPI'].isin(scriptsnjfull.npi.unique())]

In [296]:
#Saving as a csv for future use
npi.to_csv('/Volumes/Seagate/Galvanize/nj_doc_info.csv',index=False)

In [32]:
import numpy as np
import pandas as pd

npi = pd.read_csv('/Volumes/Seagate/Galvanize/nj_doc_info.csv',dtype={'Zip Code':object,'NPI':object})

In [3]:
npi.head(2)

,NPI,First Name,Last Name,Type,Gender,Address,City,State,Zip Code
0,1477556421,STEVEN,ROTH,O.D.,M,1107 MANTUA PIKE,MANTUA,NJ,08051
1,1508869553,LEE,VAN HOUTEN-SAUTER,D.O.,F,220 PINE ST,WILLIAMSTOWN,NJ,08094

In [4]:
npi[npi['First Name']=='']

Empty DataFrame
Columns: [NPI, First Name, Last Name, Type, Gender, Address, City, State, Zip Code]
Index: []

In [27]:
d = {'fn':'hi','ln':2,'no':''}

In [28]:
d_true_values = {}
for key, value in d.items():
    if value:
        d_true_values[key] = value

In [29]:
d_true_values

{'fn': 'hi', 'ln': 2}

In [18]:
x = str(d_true_values.pop('ln', None))

In [19]:
x

'2'

In [30]:
for x in d:
    print(str(d[x]).upper())

HI
2

In [22]:
d

{'fn': '', 'ln': 2}

In [33]:
npi.columns

Index(['NPI', 'First Name', 'Last Name', 'Type', 'Gender', 'Address', 'City',
       'State', 'Zip Code'],
      dtype='object')

In [34]:
bold = lambda x: '<b>'+x+'</b>'

In [40]:
len(npi.columns)/2

4.5

In [43]:
[[x,y]*len(npi.columns)/2]

TypeError: unsupported operand type(s) for /: 'list' and 'int'

In [42]:
x = 'hi'
y = 'u'

In [44]:
[x,y]

['hi', 'u']

In [57]:
print([['white','lightgrey'] * int((len(npi.columns)/2))+['white']])
print([[x,y] * int((len(npi.columns)/2))])

[['white', 'lightgrey', 'white', 'lightgrey', 'white', 'lightgrey', 'white', 'lightgrey', 'white']]
[['hi', 'u', 'hi', 'u', 'hi', 'u', 'hi', 'u']]

In [50]:
if len(npi) %2 !=0:
    print('hi')

hi

In [61]:
def l():
    if len(npi) %2 !=0:
        return([['white','lightgrey'] * int((len(npi.columns)/2))+['white']])
    else:
        return([['white','lightgrey'] * int((len(npi.columns)/2))])

In [62]:
l()

[['white',
  'lightgrey',
  'white',
  'lightgrey',
  'white',
  'lightgrey',
  'white',
  'lightgrey',
  'white']]

In [65]:
scriptsnjfull.head(2)

,npi,ln,fn,city,state,specialty_description,year,recieved_payments,total_claim_count,amount_brand,drug_name,generic_name,brand_drug?,total_day_supply,total_drug_cost
0,1528036670,LANTERI,VINCENT,MAYWOOD,NJ,Urology,2013,True,48,48,VIAGRA,SILDENAFIL,True,1481,8957.33
1,1528036670,LANTERI,VINCENT,MAYWOOD,NJ,Urology,2013,True,16,0,CLOTRIMAZOLE BETAMETHASONE,CLOTRIMAZOLE BETAMETHASONE,False,367,806.59

In [66]:
scriptsnjfull[scriptsnjfull['ln']=='KABNICK']

,npi,ln,fn,city,state,specialty_description,year,recieved_payments,total_claim_count,amount_brand,drug_name,generic_name,brand_drug?,total_day_supply,total_drug_cost
1281485,1477533925,KABNICK,LOWELL,MORRISTOWN,NJ,General Surgery,2014,True,21,0,ALPRAZOLAM ODT,ALPRAZOLAM ODT,False,26,40.93
1929976,1477533925,KABNICK,LOWELL,MORRISTOWN,NJ,General Surgery,2015,True,39,0,ALPRAZOLAM INTENSOL,ALPRAZOLAM INTENSOL,False,49,62.11